Revit 2027 API
SymbolTypeId.Bar Property
 Symbol bar, indicating unit Bars.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Bar { get; }
Public Shared ReadOnly Property Bar As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Bar {
	ForgeTypeId^ get ();
}
static member Bar : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace